<script>
  import Viewer from "./lib/Viewer.svelte";
</script>

<main>
  <h1>PNMビューワー</h1>
  <div style="top:10px;right:10px;position:fixed;"><a target="_blank" href="https://github.com/sssscccc210/PNM_viewer"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 98 96" width="30" height="30"><path fill-rule="evenodd" clip-rule="evenodd" d="M48.854 0C21.839 0 0 22 0 49.217c0 21.756 13.993 40.172 33.405 46.69 2.427.49 3.316-1.059 3.316-2.362 0-1.141-.08-5.052-.08-9.127-13.59 2.934-16.42-5.867-16.42-5.867-2.184-5.704-5.42-7.17-5.42-7.17-4.448-3.015.324-3.015.324-3.015 4.934.326 7.523 5.052 7.523 5.052 4.367 7.496 11.404 5.378 14.235 4.074.404-3.178 1.699-5.378 3.074-6.6-10.839-1.141-22.243-5.378-22.243-24.283 0-5.378 1.94-9.778 5.014-13.2-.485-1.222-2.184-6.275.486-13.038 0 0 4.125-1.304 13.426 5.052a46.97 46.97 0 0 1 12.214-1.63c4.125 0 8.33.571 12.213 1.63 9.302-6.356 13.427-5.052 13.427-5.052 2.67 6.763.97 11.816.485 13.038 3.155 3.422 5.015 7.822 5.015 13.2 0 18.905-11.404 23.06-22.324 24.283 1.78 1.548 3.316 4.481 3.316 9.126 0 6.6-.08 11.897-.08 13.526 0 1.304.89 2.853 3.316 2.364 19.412-6.52 33.405-24.935 33.405-46.691C97.707 22 75.788 0 48.854 0z" fill="#24292f"/></svg></a></div>
  <hr>
  <Viewer />
  <hr>
  <p>
    PNMファイルの仕様は，<a href="https://netpbm.sourceforge.net/doc/index.html">https://netpbm.sourceforge.net/doc/index.html</a>に定められています。<br>
    仕様と本ビューワーの対応について：
  </p>
  <table border=1>
    <tr>
      <th>仕様</th>
      <th>仕様に対する本ビューワーの対応</th>
    </tr>
    <tr>
      <td>マジックナンバー：P1，P2，P3，P4，P5，P6</td>
      <td>P1，P2，P3に対応（P4，P5，P6，および不正マジックナンバーはエラーを出す）</td>
    </tr>
    <tr>
      <td>1行あたり70文字を超えてはならない</td>
      <td>無視（70文字を超えても通常動作）</td>
    </tr>
    <tr>
      <td>最大輝度は0超65536未満である必要がある</td>
      <td>無視（現在，バイナリフォーマットに対応させていないため保存数値が3バイト以上となる数値であっても関係がないため）</td>
    </tr>
    <tr>
      <td>ヘッダーの最後尾とラスターの先頭の間には，空白文字は1つのみ</td>
      <td>無視（例え2つ以上の空白文字が存在していても，2つ目以降の空白文字は，ラスター内の各サンプルの前後にある空白文字（上限なし）として処理ができるため）</td>
    </tr>
    <tr>
      <td>'#'から次のキャリッジリターン(CR)またはラインフィード(LF)，またはファイルの終端までの任意の文字はコメントであり，無視する</td>
      <td>対応済み<br><span style="color: red">※2024年6月以前まではCR，LFもコメントに含むと規定されていたが，現在は含まない。</span></td>
    </tr>
    <tr>
      <td colspan="2" align="center">その他は仕様通り</td>
    </tr>
  </table>
  <p>◎忘れてる仕様がある，仕様に従っていない部分がある，などの場合はご連絡ください。</p>
</main>